symptoms_list = [
    "Почервоніння повік",
    "Набряк повік",
    "Випадання вій",
    "Сльозотеча",
    "Швидка втома очей",
    "Чутливість",
    "Свербіж",
    "Запалення слізного мішка",
    "Внутрішньоочний тиск",
    "Зміна поля зору",
    "Атрофія нерва",
    "Утворення на повіці",
    "Головний біль",
    "Помутніння кришталика",
    "Зниження зору",
    "Температура",
    "Лімфовузли",
    "Світлобоязнь",
    "Гіперемія",
    "Відчуття стороннього тіла",
    "Погано бачить близько",
    "Погано бачить далеко",
    "Помутніння склоподібного тіла",
    "Гнійне запалення",
    "Біль",
    "Гнійні виділення",
    "Порушення фіксації"
]

diseases = {
    "Амбліопія": {
        "P": 0.55,
        "symptoms": {
            "Порушення фіксації": (0.9, 0.2),
            "Зниження зору": (0.7, 0.3)
        }
    },

    "Блефарит": {
        "P": 0.2,
        "symptoms": {
            "Почервоніння повік": (0.8, 0.2),
            "Свербіж": (0.9, 0.2),
            "Випадання вій": (0.7, 0.1)
        }
    },

    "Дакріоцистит": {
        "P": 0.05,
        "symptoms": {
            "Сльозотеча": (0.9, 0.3),
            "Гнійні виділення": (0.8, 0.2),
            "Запалення слізного мішка": (0.9, 0.1)
        }
    },

    "Глаукома": {
        "P": 0.03,
        "symptoms": {
            "Внутрішньоочний тиск": (0.95, 0.2),
            "Зміна поля зору": (0.8, 0.3),
            "Атрофія нерва": (0.7, 0.2)
        }
    },

    "Халазіон": {
        "P": 0.01,
        "symptoms": {
            "Утворення на повіці": (0.9, 0.2)
        }
    },

    "Гіперметропія": {
        "P": 0.2,
        "symptoms": {
            "Погано бачить близько": (0.9, 0.2),
            "Головний біль": (0.6, 0.3)
        }
    },

    "Катаракта": {
        "P": 0.03,
        "symptoms": {
            "Помутніння кришталика": (0.95, 0.1),
            "Зниження зору": (0.8, 0.3)
        }
    },

    "Кон'юнктивіт": {
        "P": 0.04,
        "symptoms": {
            "Почервоніння повік": (0.9, 0.2),
            "Світлобоязнь": (0.7, 0.3),
            "Гіперемія": (0.8, 0.2)
        }
    },

    "Міопія": {
        "P": 0.06,
        "symptoms": {
            "Погано бачить далеко": (0.95, 0.2),
            "Зниження зору": (0.8, 0.3)
        }
    },

    "Пресбіопія": {
        "P": 0.07,
        "symptoms": {
            "Погано бачить близько": (0.85, 0.3)
        }
    },

    "Ячмінь": {
        "P": 0.05,
        "symptoms": {
            "Гнійне запалення": (0.9, 0.2),
            "Біль": (0.8, 0.3)
        }
    }
}

def bayes(P, PY, PN, has_symptom):
    if has_symptom:
        return (PY * P) / (PY * P + PN * (1 - P))
    else:
        return ((1 - PY) * P) / ((1 - PY) * P + (1 - PN) * (1 - P))

for disease in diseases:
    P = diseases[disease]["P"]

    print(f"\nПеревірка: {disease}")

    for symptom in diseases[disease]["symptoms"]:
        ans = int(input(f"{symptom}? (1-так / 0-ні): "))
        PY, PN = diseases[disease]["symptoms"][symptom]

        P = bayes(P, PY, PN, ans)

    diseases[disease]["result"] = P

print("\n=== РЕЗУЛЬТАТ ===")

sorted_res = sorted(diseases.items(), key=lambda x: x[1]["result"], reverse=True)

for d, info in sorted_res:
    print(f"{d}: {info['result']:.4f}")